/**
 * doocument tempate in LEXS
 */
export const DOC_TEMPLATE = {
  LEXSD001: 'LEXSD001', // เอกสารนิติบุคคล
  LEXSD002_1: 'LEXSD002-1', // เอกสารบุคคลธรรมดา
  LEXSD002_2: 'LEXSD002-2', // เอกสารบุคคลธรรมดา
  LEXSD003: 'LEXSD003', // หนังสือที่ธนาคารแจ้งผู้ค้ำประกันถึงเหตุผิดนัดชำระหนี้ภายใน 60 วัน นับแต่วันที่ลูกหนี้ผิดนัด
  LEXSD004: 'LEXSD004', // ใบตอบรับ กรณีส่งหนังสือที่ธนาคารแจ้งผู้ค้ำประกันถึงเหตุผิดนัดชำระหนี้ภายใน 60 วัน
  LEXSD005: 'LEXSD005', // R1.3 สรุปภาระหนี้ (ระดับ CIF)
  LEXSD006: 'LEXSD006', // R1.3 สรุปหลักประกัน
  LEXSD013: 'LEXSD013', // สัญญาสินเชื่อ
  LEXSD014: 'LEXSD014', // ระบบ Profile Direct - หน้า Account List
  LEXSD015: 'LEXSD015', // บันทึกข้อตกลงแก้ไขเพิ่มเติมสัญญาสินเชื่อ
  LEXSD016: 'LEXSD016', // R1.3 สัญญาปรับปรุงโครงสร้างหนี้
  LEXSD017: 'LEXSD017', // หนังสือแจ้งลูกหนี้และผู้ค้ำประกันกรณีผิดเงื่อนไขที่ต้องปฏิบัติ (Covenant)
  LEXSD024: 'LEXSD024', // คำขอทำธุรกรรม และตั๋วสัญญาใช้เงิน
  LEXSD026: 'LEXSD026', // คำขอให้ธนาคารออกหนังสือและต่ออายุหนังสือค้ำประกัน
  LEXSD027: 'LEXSD027', // สำเนาหนังสือค้ำประกัน
  LEXSD032: 'LEXSD032', // ใบคำขอเบิกเงินและเอกสารประกอบการเบิก
  LEXSD059: 'LEXSD059', // สัญญาจำนอง-น.ส.3ก.
  LEXSD190: 'LEXSD190', // Outstanding Report
  LEXSF004: 'LEXSF004', // R1.3 เอกสารอื่นๆ ที่เกี่ยวข้องกับการดำเนินคดี
  LEXSF007: 'LEXSF007', // R1.3 คำพิพากษาศาลอุทธรณ์
  LEXSF008: 'LEXSF008', // R1.3 คำพิพากษาศาลฎีกา
  LEXSF009: 'LEXSF009', // R1.3 ตารางคำนวนยอดหนี้ตามคำพิพากษา
  LEXSF010: 'LEXSF010', // R1.3 คำพิพากษา
  LEXSF012: 'LEXSF012', // R1.3 คำพิพากษาตามยอม
  LEXSF013: 'LEXSF013', // R1.3 สัญญาประนีประนอมยอมความ
  LEXSF052: 'LEXSF052', // R1.3 หนังสือรับร้องคดีถึงที่สิ้นสุด
  LEXSF055: 'LEXSF055', // R1.3 หนังสืออนุมัติผลฎีกา/ไม่ฎีกา
  LEXSF056: 'LEXSF056', // R1.3 หนังสืออนุมัติผลอุทธรณ์/ไม่อุทธรณ์
  LEXSF061: 'LEXSF061', // R1.3 เอกสารอื่นๆ
  LEXSF063: 'LEXSF063', // R1.3 รายงานกระบวนพิจารณา
  LEXSF065: 'LEXSF065', // ใบแจ้งการชำระเงิน สำนักงานศาลยุติธรรม
  LEXSF068: 'LEXSF068', // R1.3 เอกสารยกเลิกชะลอดำเนินคดี
  LEXSF069: 'LEXSF069', // R1.3 เอกสารยกเลิกยุติดำเนินคดี
  LEXSF073: 'LEXSF073', // หลักฐานการคืนเงินค่าธรรมเนียมศาลสั่งคืน
  LEXSF074: 'LEXSF074', // ตารางบัญชีค่าฤชาธรรมเนียมศาล
  LEXSF079: 'LEXSF079', // R1.3 บันทึกขออนุมัติชะลอดำเนินคดี
  LEXSF080: 'LEXSF080', // R1.3 เอกสารเกี่ยวกับการยุติดำเนินคดี
  LEXSF081: 'LEXSF081', // R1.3 บันทึกงดอุทธรณ์โดย KTBLAW
  LEXSF082: 'LEXSF082', // R1.3 บันทึกงดฎีกาโดย KTBLAW
  LEXSF083: 'LEXSF083', // R1.3 คำร้องขอขยายระยะเวลาอุทธรณ์
  LEXSF084: 'LEXSF084', // R1.3 คำร้องขอขยายระยะเวลาฎีกา
  LEXSF085: 'LEXSF085', // R1.3 เอกสารที่เกี่ยวข้องกับการพิจารณาอุทธรณ์
  LEXSF086: 'LEXSF086', // R1.3 เอกสารที่เกี่ยวข้องกับการพิจารณาฎีกา
  LEXSF096: 'LEXSF096', // R1.3 ใบเสร็จรับเงินจากศาล
  LEXSF098: 'LEXSF098', // R1.3 บัญชีค่าฤชาธรรมเนียมตามคำพิพากษา
  LEXSF103: 'LEXSF103', // หนังสือมอบอำนาจของทนายความ
  LEXSF104: 'LEXSF104', // คำขอออกหมายบังคับคดี
  LEXSF105: 'LEXSF105',
  LEXSF107: 'LEXSF107', // คำขอยึดทรัพย์ต่างสำนักงานบังคับคดี
  LEXSF108: 'LEXSF108', // คำขอนำส่งต้นฉบับเอกสาร
  LEXSF112: 'LEXSF112', // คำแถลงสวมสิทธิ์แทนโจทก์
  LEXSF114: 'LEXSF114', // เอกสารเกี่ยวกับการชะลอบังคับคดี
  LEXSF115: 'LEXSF115', // R2.1 เอกสารเกี่ยวกับการยกเลิกชะลอบังคับคดี
  LEXSF116: 'LEXSF116',
  LEXSF117: 'LEXSF117',
  LEXSF118: 'LEXSF118', // Payment Report
  LEXSF119: 'LEXSF119', // R2.1 ใบแจ้งหนี้ค่าธรรมเนียมตั้งเรื่องยึดทรัพย์
  LEXSF120: 'LEXSF120', // R2.1 ใบเสร็จค่าธรรมเนียมการยึดทรัพย์
  LEXSF130: 'LEXSF130', // Outstanding report
  LEXSF130_2: 'LEXSF130-2',
  LEXSF131: 'LEXSF131', // Payment report
  LEXSF131_2: 'LEXSF131-2',
  LEXSF132: 'LEXSF132', // Loan Account Interest From Date
  LEXSF132_2: 'LEXSF132-2',
  LEXSF133: 'LEXSF133', // R2.1.2 อัปโหลดหมายเรียกวงเงินเพิ่ม ** Auction
  LEXSF134: 'LEXSF134', // R2.1.2 อัปโหลดตำสั่งเจ้าพนักงานบังคับคดี ** Auction
  LEXSF135: 'LEXSF135', // ใบแจ้งหนี้ค่าใช้จ่ายประกาศขายทอดตลาด
  LEXSF136: 'LEXSF136', // ใบเสร็จค่าใช้จ่ายประกาศขายทอดตลาด
  LEXSF137: 'LEXSF137', // LEX2-520: [EXECUTION] บันทึกผลการขายของแต่ละนัด
  LEXSF138: 'LEXSF138', // LEX2-520: [EXECUTION] บันทึกผลการขายของแต่ละนัด
  LEXSF139: 'LEXSF139', // LEX2-520: [EXECUTION] บันทึกผลการขายของแต่ละนัด
  LEXSF140: 'LEXSF140', // LEX2-520: [EXECUTION] บันทึกผลการขายของแต่ละนัด
  LEXSF141: 'LEXSF141', // อัปโหลดคำร้องขยายเวลา
  LEXSF142: 'LEXSF142', // R2.1.2 ใบเสร็จชำระวางเงิน ** Auction
  LEXSF146: 'LEXSF146', // LEX2-5369: บัญชีรับจ่ายจากการซื้อขายทรัพย์
  LEXSF147: 'LEXSF147', // R2.1.2 บัญชีส่วนได้ใช้แทน ** Auction
  LEXSF148: 'LEXSF148', // สำเนากรมธรรม์ประกันภัย
  LEXSF160: 'LEXSF160', // หมายตรวจรับรองบัญชีรับ-จ่าย
  LEXSF175: 'LEXSF175', // แคชเชียร์เช็คจากการขายทรัพย์ตามบัญชีรับจ่าย
  LEXSF176: 'LEXSF176', // LEX2-5369: เอกสาร credit note ตามบัญชีรับจ่าย
  LEXSF196: 'LEXSF196', // บันทึกอนุมัติโอนกรรมสิทธิ์ใน 5 วันทำการสุดท้ายของเดือน
  LEXSF197: 'LEXSF197', // เอกสารคำแถลงติดตามบัญชีรับจ่าย
  LEXSF212: 'LEXSF212', // ใบเสร็จวางเงินเพิ่ม
  LEXSD222: 'LEXSD222', // หนังสือสั่งการตัดหักบัญชีชำระหนี้
  LEXSD225: 'LEXSD225', // หนังสือสั่งการตัดหักบัญชีชำระหนี้
  LEXSF193: 'LEXSF193', // LEX2-420: [EXECUTION]รายละเอียดงานสั่งการสืบทรัพย์
  LEXSF194: 'LEXSF194', // LEX2-420: [EXECUTION]รายละเอียดงานสั่งการสืบทรัพย์
  LEXSF195: 'LEXSF195', // LEX2-420: [EXECUTION]รายละเอียดงานสั่งการสืบทรัพย์
  LEXSF018: 'LEXSF018', // LEX2-420: [EXECUTION]รายละเอียดงานสั่งการสืบทรัพย์
  LEXSD007: 'LEXSD007', // LEX2-420: [EXECUTION]รายละเอียดงานสั่งการสืบทรัพย์
  LEXSD008: 'LEXSD008', // LEX2-420: [EXECUTION]รายละเอียดงานสั่งการสืบทรัพย์
  LEXSD002: 'LEXSD002', // LEX2-420: [EXECUTION]รายละเอียดงานสั่งการสืบทรัพย์
  LEXSF129: 'LEXSF129',
  LEXSF311: 'LEXSF311', // LEX2-42046:[EXECUTION] On-request สั่งการยื่นคำร้องขอรับชำระหนี้บุริมสิทธิ
  LEXSF137MINUS2: 'LEXSF137-2', // LEX2-42046:[EXECUTION] On-request สั่งการยื่นคำร้องขอรับชำระหนี้บุริมสิทธิ
};
