/**
 * หลักประกันที่จ่ายเงินผ่านระบบ e-filing ได้ สามารถทำการบันทึกผลการตั้งเรื่องยึดทรัพย์ เป็นไปตามหน้าจอของการบันทึกผลของการยึดทรัพย์ LEX2-461 โดยประกอบไปด้วยประเภทหลักประกัน
 ** Coll-type = “1” ที่ดิน
 ** Coll-type = “2” ที่ดินพร้อมสิ่งปลูกสร้าง”
 ** Coll-type = “3“ อาคารสิ่งปลูกสร้าง
 ** Coll-type = “4“ คอนโดมิเนียม/อาคารชุด
 */
export const EFilingCategory = ['1', '2', '3', '4'];

/**
 * หลักประกันที่จ่ายเงินผ่านระบบ e-filing ไม่ได้ เป็นประเภทที่ต้องมีเจ้าหน้าที่บังคับคดี ออกยึดทรัพย์ โดยมีการบันทึกเอกสาร และการจ่ายเงินที่แตกต่างออกไป โดยประกอบไปด้วยประเภทหลักประกัน
 ** Coll-type = “5“ เครื่องจักร
 ** Coll-type = “7“ สินค้า
 */
export const NoneEFilingCategory = ['5', '7'];

/**
 * หลักประกันที่ต้องทำการพิจาณาเป็นรายการๆ ไป ซึ่งจะต้องดูรายละเอียดของหลักประกัน ตามดุลพินิจของทนายความ ว่าจะต้องทำการจ่ายเงินผ่านระบบ e-filing ได้ หรือต้องให้เจ้าหน้าที่บังคับคดี ออกยึดทรัพย์ โดยประกอบไปด้วยประเภทหลักประกัน
 ** Coll-type = “6“ สิทธิการเช่า
 ** Coll-type = “9“ ตราสารทุน
 */
export const EFilingOptionCategory = ['6', '9'];
