import { SimpleSelectOption } from '@spig/core';

/**
 * รายการเหตุผลการยึดทรัพย์
 */
export const reasonOption: SimpleSelectOption[] = [
  { value: '1', text: 'ถูกเจ้าหนี้รายอื่นยึด' },
  { value: '4', text: 'ทรัพย์ถูกโอนให้บุคคลอื่นก่อนยึด' },
  { value: '5', text: 'มีคำสั่งห้ามโอน (ตรวจสอบจากหลังโฉนดเช่นห้ามโอน 10 ปี)' },
  { value: '2', text: 'ทรัพย์ที่ยึดไว้ เกินภาระหนี้แล้ว ไม่สามารถยึดทรัพย์เพิ่มได้' },
  { value: '3', text: 'ที่ดินออกเอกสารสิทธิ์ทับที่ ป่าสงวน, ที่ดินสาธารณะประโยชน์' },
  { value: '99', text: 'อื่นๆ' },
];
